{"data":{"markdownRemark":{"html":"<h2>About Will</h2>\n<p>This spring, I graduated college with a B.S. in Computer Engineering\nand a minor in Computer Science - somehow with a <strong>4.0 GPA</strong>.\nCollege was the first time in my life that I <strong>worked my ass off and\nsaw the results I was looking for</strong>. While in school, I interned at\n<strong>Boeing</strong>,\n<strong>LMI Aerospace</strong>,\nand <strong>Garmin</strong>, spent an\nunseemly amount of time\nworking with and leading my university's\n<a href=\"http://solarcar.mst.edu\">solar car team</a> as an\nElectrical/Software Team Member and\nas President, and took up the religion of technical interview prep (complete\nwith <a href=\"https://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/0984782850\">bible</a>).</p>\n<p>Here's what a few of my managers had to say about me along the way:</p>\n<blockquote>\n<p>\"Overall, Will exceeded my expectations for his\nperformance values as an intern. He is very professional,\ninnovative, and has great presentation skills.\" - Jessica Poor, Boeing</p>\n</blockquote>\n<blockquote>\n<p>\"Will’s overall performance exceeded expectations for a software engineering\nintern... Will spent a lot of his time outside of the internship\nleading his solar car project for the university.\nThe fact that he was able to support both was a good demonstration of\nhis 'high throughput' capabilities.\" - Ted Mabie, Garmin</p>\n</blockquote>\n<p>That's not to say my time wasn't spent without failures\n(yeah 2018 solar car race, I'm talking about you). But life's a mixed bag. All\nyou can do is learn from your experience and get better - at least that's what\nI'm trying to do.</p>\n<p>Now, all this work paid off when I landed my dream job as a\nSoftware Engineer at <strong>Microsoft</strong>. I'll be starting in their Seattle office\nin the fall and I'm </p>\n<p>But something didn't seem right.\nI did the work, I got the degree, the job, and the\n<a href=\"https://www.census.gov/topics/families/families-and-households.html\">1.86 children</a>\nsupporting salary, but I still feel like there's more to life. I feel like\nI have yet to really explore my passions and find what drives me.</p>\n<p>The biggest life lesson I've learned to date is that\n<strong>I don't know what the hell to do with my life</strong> and I've set\nout to find some answers.\nThat's what this website is about: me trying things out - seeing what I like,\nwhat I hate, what fuels me, and what makes me want to quit my day job. So if\nyou're into that, stick around because that's my journey and I hope watching\nit unfold won't disappoint.</p>\n<p>Thanks for reading.</p>\n<div style='margin-top: 1rem; width: 12rem;'>\n  <img\n  style='display: block; width: 12rem; height: auto;'\n  src='sig.png'\n  alt=\"Will's signature\"\n  />\n  <p style='display: block; fontSize: .8rem;'>June `19</p>\n</div>","frontmatter":{"title":""}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/about/"}}