{"data":{"markdownRemark":{"html":"<h2>The Optimization of Social Media</h2>\n<p>I'm torn. All around me, people are leading two lives: Digital and otherwise\nand I'm wrestling with the idea of continuing to use the social technologies that\nare second nature to many.</p>\n<p>For some, the distinction between \"real life\" and digital life is blurred.\nGo to any scenic vista in a National\nPark and there will be some poor soul posing like a Vogue model in a crude\nattempt to milk their 250 followers for the praise they need to feel ok.\nThese are cases where the present moment, spent\nin seemingly beautiful circumstances, is utterly forsaken while searching for\nthe approval of others, as it seems increasingly difficult to take in a\nbeautiful moment while resisting the urge to make it yours by\nanchoring a two-dimensional version of it to your Instagram feed.</p>\n<p>For others, they seem to just \"get it\" on social media. I found in my experience\nthat those who I perceive\nas driven and successful, with easy-to-get-behind values that shine through in\ntheir creative work, use social media differently. Their posts alerted\ntheir followers of their newest creations, of collaborations, musings and insights meant\nnot to boost <em>their</em> ego, but to brighten to day of whoever made it into\nthe orbit of their digital sun.</p>\n<p>I must concede that I don't know these people who seem to excel in\ndigital media personally which is, fortunately\nor unfortunately, not the case with parishioners of the former mindset.\nWould this facade of meaningfully curated content collapse when faced with scrutiny? If\nthe kid met their hero face to face, would they be viewed differently?</p>\n<p>In this case question which explanation\nwould be the simplest and perhaps the most valid: Would (a) these people\nwho on the surface appear, in my opinion, to be using social media well (i.e. using\nsocial media not for the benefit of themselves but instead for the\nbenefit of others) or (b) these people are frauds who secretly do all this\nfor the benefit of themselves.</p>\n<p>I believe that both explanations are in part true.\nWhatever people do, they do it for themselves. This may sound unnecessarily\nharsh, but stick with me.</p>\n<p>Have you ever volunteered? This could have been any such donation -\nhelping to prepare a meal at a food kitchen, shoveling snow\nfrom an elderly neighbor's driveway, holding the door open for a stranger.\nIf you've ever volunteered, you know what it feels like to positively impact\nthe life of another person, however small the impact is. Choosing to\nspend ones time in service of others is simultaneously serving two\nparties: The server and the served. Everyone involved benefits. If I just\nbought lunch for a homeless man, I feel good for my donation and the\nhomeless man is gratified to be on the receiving end of kindness.\nThis isn't a zero sum game.</p>\n<p>Steering back into what this whole discussion is supposed to be about:\nThe problem of optimizing how one uses social media can be directly\nmapped to the idea of giving to others.</p>\n<p>Thinking back to the earlier discussion of using social media for the\npurposes of sharing with others <em>for their benefit</em> turns out to not\nonly benefit whoever read that post or saw that picture. If the post's author knows that one\nperson got even an inkling of value from what they put out into the world,\nthat author will be left with the satisfaction of positively affecting a life.\nThat is neither a small feat nor a small reward.</p>\n<p>The flip side of this comes when people use social media for <em>their\nbenefit only</em>. Here, imagine the gym-bro posting some muscle pics\nwith a few emojis to caption. This type of content\ndoes nothing but act as a funnel through which praise from his peers\nstreams in. Did what he posted positively impact anyone but himself?\nIn most cases, the answer is likely no. What's more is that his satisfaction\nis fleeting. What happens a few days later when the post has grown stale?\nLikes stop rolling in and the dopamine stream runs dry. There is not a\nmore shallow act than to beg for acceptance in such a way.\nI only write this because I've lived it - seeking\nthe ever-illusive approval of others through social media when in fact\nthe only approval I really needed was approval from myself.</p>\n<p>Regardless of how you use social media, you are doing so for the\nbenefit of yourself. But fortunately, you have the choice of what\nkind of person you want to be. Do you want to be shallow and self serving,\nor would you rather derive meaning from the well that is helping\nyour fellow man?</p>\n<p>I've made my mind up.</p>","frontmatter":{"title":""}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/social-media/"}}